{
  "data": [
    {
      "body": "<h2>Introduction</h2>\n<p>    Picking up litter is a good thing. There’s nothing wrong or shameful about picking up litter. If anything, we should feel proud whenever we pick up a piece of trash off the ground.<br>\n    However, whenever I think about whether or not I should pick up a piece of litter, a voice in my head says, “What if someone sees you?”<br>\n    Almost as if I’m about to commit some crime. There’s this shame of being caught in the middle of doing a good deed, like an inmate being caught in the middle of an escape attempt.<br>\n    But why does this shame exist? I know that picking up litter is good. Whoever sees me knows that picking up litter is good. There’s nothing condemnable about picking up litter, so why do I feel the need to hide myself whenever I pick up trash?<br>\n    Why are people afraid of being seen doing good?</p>\n<h2>We Don’t Want to Appear Boastful</h2>\n<p>In the Book of Matthew in the Bible, Jesus says:</p>\n<p>&quot;Be careful not to practice your righteousness in front of others to be seen by them. If you do, you will have no reward from your Father in heaven. So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. But when you give to the needy, do not let your left hand know what your right hand is doing, so that your giving may be in secret. Then your Father, who sees what is done in secret, will reward you&quot; (NIV, Matthew 6:1-4).</p>\n<p>    Christianity is a major part of American culture, and I believe that is part of why we make such an effort to hide our good deeds: we’ve been conditioned to do so.<br>\n    Yet even beyond religion, there’s just something that feels gross about showing off. We don’t like hearing other people brag about how good they are. Maybe it’s because they make us insecure, or maybe it’s because we’ve been taught that humility is a good social lubricant. But whatever the case, hearing other people brag excessively stirs up nasty feelings in us.<br>\n    More bluntly, people who boast are dicks. We don’t want to be like them. They gross us out so much that we are horrified at the possibility that some stranger might think that we are one of them, so we make an earnest effort to hide our good deeds.</p>\n<h2>Virtuous Expectations</h2>\n<p>    Suppose you gave a homeless man some money–okay, that’s too unrealistic.<br>\n    Suppose you donated some money to a charity (because you are scared of being physically close to homeless people), but some saw you do it. They could form two opinions of you:</p>\n<ol>\n<li>You are a show-off</li>\n<li>You’re a nice guy</li>\n</ol>\n<p>    We’ve dealt with the first case already. But what about the second, and probably more likely case?<br>\n    When they see us giving for the first time, they weren’t expecting us to display generosity, and we defied their expectation by donating to that charity, and consequently set a new expectation of generosity that’s etched into their memory.<br>\n    Each consequent gift we give won’t be memorable, since generosity is now the status quo. But what if we stopped giving to that charity?<br>\n    Now, if our friend finds out, their expectation of generosity will be defied, and this instance of closefistedness will override all the previous instances of generosity, since we’ve violated the status quo by refusing to give.<br>\n    Rousseau puts it as:</p>\n<p>&quot;He who refuses a spontaneous favor the first time it is asked of him gives the one he has refused no right to complain. But he who, in a similar case, refuses the same person the same kindness he heretofore accorded him, frustrates a hope he has authorized him to conceive. He deceives and belies an expectation he has engendered&quot; (The Reveries of the Solitary Walker, by Jean-Jacques Rousseau, translated by Charles E. Butterworth).</p>\n<p>    When we find out that somebody started donating to a charity, we praise them. When we find out that somebody stopped donating to a charity, we condemn them. That’s why we are so scared of people finding out about our good deeds: if they ever find out that we stopped being as virtuous, they’ll condemn us.</p>\n<h2>How do Deal with the Shame</h2>\n<p>    Being ashamed of doing good can help you to a certain extent. You’re less likely to come across as a desperate attention-seeking showoff. However, too much shame can push you away from doing good in general. After all, nobody can see you doing good if you don’t do any good in the first place.<br>\n    People often say: Just don’t care about what other people think of you. While this will ensure that shame doesn’t stop you from doing good, we all know that it’s a little unrealistic to not care about what other people think. Besides, being too carefree of other people’s opinions could make you obnoxious.<br>\n    Here are some more realistic ways to do good while minimizing the shame:</p>\n<h3>Organize Group Events</h3>\n<p>    Shame tends to dissipate when you are in a group. Furthermore, more people doing good generally results in more good being done. So pick up litter with a group, do a charity run with a group, volunteer with a group. Not only will this lessen the shame, it will could also make the work more enjoyable (assuming these are enjoyable people to be around).<br>\n    You are unlikely to come off as boastful when you are in a group because boastful dicks like the spotlight to shine on them alone, and you are forced to share the spotlight when you are in a group. So, dicks don’t move in groups. And you, by being in a group, lessen the possibility that somebody mistakes you for a dick.<br>\n    People are also less likely to develop an expectation of virtue from you. They will instead develop that expectation for the group, not for the individuals within it. So, if you ever stop going, bystanders probably won’t even notice. Their expectation will only be violated when most or all of the group stops doing good, which is unlikely. Furthermore, at that point, the shame will be diluted by the (hopefully) numerous group members.</p>\n<h3>Do Good with the Pretext that It’s a One-Time Thing</h3>\n<p>    Expectations of virtue are a pain because they will always be violated one day, and when that day comes, all of your cheerleaders will become your executioners. But luckily, we lower the likelihood that people develop this expectation of us.<br>\n    Suppose someone saw you picking up litter. An expectation of virtue is developed → timeskip → they hate you for not picking up a piece of litter one day. We don’t want that.<br>\n    Now, suppose someone saw you look at a piece of litter, then look at an anti-littering sign, sigh, and begrudgingly pick up that piece of litter. Now they’ll think “That was a nice act, but there’s no way he does it regularly,” and consequently won’t develop an expectation of virtue.<br>\n    Holidays are a good way to convince people that you are only doing good due to some extraordinary circumstance. If you asked your friends to pick up litter with you, they’ll likely develop an expectation of virtue. However, if you were to ask them on Earth Day (and inform them it’s Earth Day because who bothers remembering all these holidays anyways), they’ll think “He probably only does this once a year, on Earth Day” and won’t develop an expectation of virtue.<br>\n    A bonus point for holidays is that there are a lot of them. There’s one for pretty much every charitable cause thanks to the UN, so you don’t need to worry about running out of excuses for doing good if you choose to use holidays.<br>\n    Here’s a list of some useful holidays and what activity they can use to justify:</p>\n<ol>\n<li>Earth Day\n<ol>\n<li>Picking up litter</li>\n</ol></li>\n<li>World Water Day\n<ol>\n<li>Telling your friends about charities like The Water Project</li>\n</ol></li>\n<li>Global Recycling Day\n<ol>\n<li>Buy from brands that recycle and promote those brands</li>\n</ol></li>\n<li>World Environment Day\n<ol>\n<li>Go vegan for a day</li>\n</ol></li>\n<li>International Day for the Eradication of Poverty\n<ol>\n<li>Donate to charities</li>\n</ol></li>\n<li>World Mental Health Day\n<ol>\n<li>Check in on your friends</li>\n</ol></li>\n<li>International Volunteer Day\n<ol>\n<li>Maybe try volunteering on this day or something idk</li>\n</ol></li>\n<li>And a bunch more, just look them up</li>\n</ol>\n<h2>Conclusion</h2>\n<p>    While shame is commonly associated with doing bad things, there are times when doing a good deed can make you ashamed. This is because</p>\n<ol>\n<li>We are scared of appearing boastful</li>\n<li>We are scared that people will expect us to consistently be virtuous</li>\n</ol>\n<p>    We could lessen the shame by refusing to worry about the opinions of strangers. However, that’s a high bar for some people. So, we looked at more realistic ways to reduce shame:</p>\n<ol>\n<li>Do good with a group</li>\n<li>Pretend that you are doing good due to external influences (like holidays) and not intrinsic motivation</li>\n</ol>\n<p>    While this post focused on managing other people’s perception of you, it’s important to remember that we aren’t doing good to improve other people’s image of us, or even to improve our self-image. We are doing good to help other people. We are managing other people’s perception of us for the sole purpose of making it easier for us to do good. If you find that my advice on perception management is making you hyperfocus on what other people think and consequently hindering your efforts to do good, please forget everything I’ve said.</p>\n",
      "title": "Why Are People Ashamed of Doing Good?",
      "date": "2025-07-24T00:00:00.000Z",
      "description": "While people feel shame for doing bad things, sometimes people feel just ashamed when they do good. Why?",
      "isCompleted": true,
      "slug": "why-are-people-ashamed-of-doing-good",
      "tags": []
    }
  ]
}